# config/messages.py


# Основні повідомлення
WELCOME_MESSAGE = """
🚊 Вас вітає бот Одеського міського електротранспорту!

Оберіть потрібну опцію:
"""

COMPLAINT_START = "💬 Будь ласка, опишіть детально суть вашої скарги:"
COMPLAINT_ROUTE = "🚃 Вкажіть номер маршруту (цифрою, наприклад: <code>7</code> або <code>10</code>):"
COMPLAINT_BOARD = "🔢 Вкажіть бортовий номер (4-значне число на кабіні/в салоні/ззовні, наприклад: <code>4015</code>):"
COMPLAINT_DATETIME = "🗓️ Вкажіть дату та час інциденту \n\n(у форматі <code>ДД.ММ.РРРР ГГ:ХХ</code>,\n наприклад: 12.04.2025 15:06):"
COMPLAINT_NAME = "👤 Вкажіть ваше П.І.Б. (наприклад: Писаренко Олег Анатолійович):"
COMPLAINT_PHONE = "📞 Вкажіть ваш контактний телефон (для зворотнього зв'язку):"
SUGGESTION_START = "💡 Будь ласка, опишіть вашу пропозицію або ідею:"
SUGGESTION_ASK_CONTACT = "Дякуємо! Напишіть будь ласка Ваші контакти (П.І.Б. та телефон) для зворотнього зв'язку."
SUGGESTION_NAME = "👤 Вкажіть ваше П.І.Б. (наприклад: Писаренко Олег Анатолійович):"
SUGGESTION_PHONE = "📞 Вкажіть ваш контактний телефон (для зворотнього зв'язку):"
COMPLAINT_EMAIL = "📧 Вкажіть Вашу електронну адресу (для офіційної відповіді):"
SUGGESTION_EMAIL = "📧 Вкажіть Вашу електронну адресу (необов'язково):"
COMPANY_HISTORY = (
    "🏛️ <b>Історія та Сучасність</b>\n\n"
    "КП «Одесміськелектротранс» є одним з найстаріших транспортних підприємств України. 🇺🇦\n\n"
    "Його витоки сягають далекого 1880 року, коли «Бельгійське товариство Одеських кінно-залізних доріг» "
    "почало будівництво та експлуатацію вагонів з кінної тяги, а згодом — і з паровою."
)


MESSAGES = {
    "welcome": WELCOME_MESSAGE,
    "complaint_start": COMPLAINT_START,
    "complaint_route": COMPLAINT_ROUTE,
    "complaint_board": COMPLAINT_BOARD,
    "complaint_datetime": COMPLAINT_DATETIME,
    "complaint_name": COMPLAINT_NAME,
    "complaint_phone": COMPLAINT_PHONE,
    "suggestion_start": SUGGESTION_START,
    "suggestion_ask_contact": SUGGESTION_ASK_CONTACT,
    "suggestion_name": SUGGESTION_NAME,
    "suggestion_phone": SUGGESTION_PHONE,
    "complaint_email": COMPLAINT_EMAIL,
    "suggestion_email": SUGGESTION_EMAIL,
    # Зворотний зв'язок (статичні)
    "realtime_transport": "Для відстеження руху транспорту в реальному часі...\n[Ваш текст про 'MISTO']",
    "lost_items": "Інформаційний центр знаходиться за адресою: [Адреса]...\n[Ваш текст про загублені речі]",

    # Квитки та тарифи
    "tickets_cost": (
        "🎟️ <b>Вартість разового квитка: 15 грн.</b>\n\n"
        "👮‍♂️ <b>Штраф за безквитковий проїзд: 300 грн.</b>\n\n"
        "🧾 <i>З вартістю проїзних можна ознайомитися у попередньому меню, "
        "натиснувши кнопку 'Види проїзних'.</i>"
    ),
    "tickets_payment": (
        "💳 <b>Сплатити за проїзд можна:</b>\n\n"
        "📱 <b>Через QR-код</b>\n"
        "<i>(в кожному вагоні трамваю або тролейбусі, картою будь-якого банку)</i>\n\n"
        "💵 <b>Готівкою</b>\n"
        "<i>(у водія або кондуктора)</i>"
    ),
    "tickets_purchase": (
        "<b>Де придбати разовий квиток чи проїзний?</b> 🤔\n\n"
        "--- \n\n"
        "🏪 <b>ОФЛАЙН (у транспорті / в касі):</b>\n\n"
        "▪️ <b>Разовий квиток:</b>\n"
        "   <i>Придбайте безпосередньо у водія або кондуктора в салоні трамвая чи тролейбуса.</i>\n\n"
        "▪️ <b>Проїзний квиток (фізичний):</b>\n"
        "   <i>У квиткових касах, що розташовані на кінцевих станціях ключових маршрутів.</i>\n\n"
        "--- \n\n"
        "📱 <b>ОНЛАЙН (безготівково):</b>\n\n"
        "▪️ <b>Разовий квиток (електронний):</b>\n"
        "   <i>Відскануйте QR-код на наліпці у салоні. Оплата приймається карткою будь-якого банку України.</i>\n\n"
        "▪️ <b>Проїзний квиток (електронний):</b>\n"
        "   <i>Через мобільний додаток «Приват24» оберіть потрібний Вам проїзний.</i>\n\n"
        "   При покупці проїзного квитка терміном на 1 місяць, \n<b>⚠️ЗВЕРТАЙТЕ УВАГУ⚠️</b>"
        "на дію закінчення проїзного квитка."
    ),
    "tickets_benefits": (
        "<b>Хто має право на пільговий проїзд?</b> 📜\n\n"
        "<i>Для підтвердження права необхідно мати при собі <b>оригінал</b> "
        "відповідного посвідчення.</i>\n\n"
        
        "<b>🎖️ Військовослужбовці та Ветерани:</b>\n"
        "- Учасники бойових дій\n"
        "- Особи з інвалідністю внаслідок війни\n"
        "- Ветерани військової служби, МВС, Нацполіції та податкової міліції, "
        "Бюро економічної безпеки України, державної пожежної охорони, "
        "Державної кримінально-виконавчої служби України, служби цивільного захисту, "
        "Державної служби спеціального зв’язку та захисту інформації України\n"
        ""
        "- Військовослужбовці строкової служби\n"
        "- Батьки військовослужбовців, які загинули (зникли безвісти)\n"
        "- Курсанти закладів МВС\n\n"
        
        "<b>🛡️ Представники служб (при виконанні):</b>\n"
        "- Поліцейські\n"
        "- Співробітники СБУ\n"
        "- Військовослужбовці НГУ\n"
        "- Особовий склад ДСЗІ та ДПСУ\n"
        "- Працівники органів виконання покарань\n\n"
        

        "<b>❤️‍🩹 Особи з інвалідністю та Чорнобильці:</b>\n"
        "- Особи з інвалідністю I та II груп\n"
        "- Ліквідатори та потерпілі від ЧАЕС (Кат. 1, 2)\n"
        "- Реабілітовані особи (що стали особами з інв. або є пенсіонерами)\n\n"
        
        "<b>👨‍👩‍👧‍👦 Діти та Сім'ї:</b>\n"
        "- Діти до 7 років\n"
        "- Діти з інвалідністю\n"
        "- Діти-сироти та позбавлені батьківського піклування\n"
        "- Діти з багатодітних сімей\n\n"

        "<b>🧑‍🤝‍🧑 Супроводжуючі особи:</b>\n"
        "- Супровід особи з інвалідністю I групи\n"
        "- Супровід дитини з інвалідністю\n"
        "<i>(не більше однієї супроводжуючої особи)</i>\n\n"

        "<b>👵 Пенсіонери:</b>\n"
        "- Пенсіонери за віком\n\n"
    ),
    "tickets_purchase_info": (
        "<b>Де придбати проїзний?</b> 🤔\n\n"
        "🏪 <b>Офлайн:</b>\n"
        "<i>Шукайте квиткові каси на кінцевих станціях маршрутів.</i>\n\n"
        "📱 <b>Онлайн:</b>\n"
        "<i>Зручно та швидко через мобільний додаток \"Приват24\" відсканувавши QR-код "
        "на наліпці в салоні трамвая/тролейбусу.</i>"
    ),

    # Довідкова інформація
    "info_rules": "📜 Ось офіційні правила користування міським електротранспортом:",
    "info_accessibility": (
        "♿️ <b>Доступність та Інклюзивність</b>\n\n"
        "Ми прагнемо зробити міський електротранспорт комфортним для кожного пасажира. "
        "Дізнатися інформацію про рух низькопідлогового електротранспорту можна "
        "у розділі 'Пошук інклюзивного транспорту' головного меню\n\n"
        "<b>🚌 Низькопідлоговий транспорт:</b>\n\n"
        "На маршрутах міста вже працюють сучасні низькопідлогові трамваї "
        "(зокрема, нові трисекційні трамваї K1T306, які можна зустріти, наприклад, на маршруті **№7**) та тролейбуси."
        "\n\n"
        "🧑‍🦽 <b>Правила перевезення для маломобільних груп:</b>\n\n"
        "Особи з інвалідністю та інші маломобільні групи населення (згідно переліку пільгових категорій)"
        " мають право на <b>безоплатне</b> перевезення:\n\n"
        "▪️ Технічних та інших засобів реабілітації (крісла колісні, палиці, милиці, ходунки тощо);\n\n"
        "▪️ Собак-поводирів 🐕‍🦺 (що супроводжують осіб з порушеннями зору);\n\n"
        "▪️ Дитячих візків 👶 або інших засобів для пересування дітей.\n\n"
    ),
    "info_contacts": (
        "📞 <b>Контакти КП 'Одесміськелектротранс'</b>\n\n"
        "📍 <b>Адреса:</b>\n"
        "65007, м. Одеса, вул. Водопровідна, 1\n\n"
        "☎️ <b>Гаряча лінія (Інформаційний центр):</b>\n"
        "<code>+38-(094)-921-98-86</code>\n\n"
        "<code>+38-(048)-788-68-86</code>\n\n"
        "📠 <b>Приймальня:</b>\n"
        "<code>+38-(048)-717-54-00</code>\n\n"
        "✉️ <b>Електронна пошта (для скарг та пропозицій):</b>\n"
        "info@oget.od.ua"
    ),
    # Музей
    "museum_info": (
        "🏛️ <b>Ласкаво просимо до Музею ОМЕТ!</b>\n\n"
        "Це унікальне сховище історії пасажирського транспорту Одеси з XIX по XXI століття.\n\n"
        "Наш музей не має аналогів в Україні та регулярно проводить екскурсії та заходи. \n\n"
        "<i>Щоб записатись на екскурсію, поверніться до попереднього меню.</i>"
    ),

    # Про підприємство
    "company_education": (
    "🎓 <b>Отримайте професію водія!</b>\n\n"
    "Навчально-курсовий комбінат КП «Одесміськелектротранс» запрошує всіх бажаючих на <b>безкоштовні</b> курси:\n\n"
    "▪️ <b>Водій трамвая</b> (термін навчання 6 місяців)\n"
    "▪️ <b>Водій тролейбуса</b> (термін навчання 6 місяців)\n\n"
    "<b>Етапи навчання:</b>\n"
    "1️⃣ <b>Теорія:</b> у cучасних комп'ютерних класах.\n"
    "2️⃣ <b>Практика:</b> на спеціальному учбовому транспорті.\n\n"
    "Після успішного закінчення та отримання категорії “Т” у водійському посвідченні, ми <b>гарантуємо працевлаштування</b>!\n\n"
    "<b>Що ми пропонуємо:</b>\n"
    "✅ Стабільну роботу та гідну зарплату\n"
    "✅ Повний соціальний пакет\n"
    "✅ Пільгову пенсію\n"
    "✅ Іногороднім надається місце у сучасному гуртожитку (зі спортзалом, секціями боксу та тенісу! 🥊)\n\n"
    "\n\n"
    "📞 <b>Зацікавились? Звертайтесь!</b>\n\n"
    "📍 <b>Наша адреса:</b>\n"
    "м. Одеса, вул. Водопровідна 1 (Учбово-курсовий комбінат)\n\n"
    "☎️ <b>Телефони для довідок:</b>\n"
    "<code>+38-(048)-717-54-66</code> (Учбовий комбінат)\n"
    "<code>+38-(50)-309-42-45</code>"
),
    "company_services": (
    "🚌 <b>Оренда транспорту для ваших подій!</b>\n\n"
    "Шукаєте оригінальну альтернативу звичайному транспорту? 🥳\n"
    "Замовте трамвай або тролейбус (включно з <b>Ретро-вагоном</b>) для весілля, дня народження, корпоративу, тощо!\n\n"
    "📞 <b>Телефон для довідок:</b> <code>+38-(048)-717-54-41</code>"
),
    "company_socials": (
    "📰 <b>Будьте в курсі подій!</b>\n\n"
    "На нашому офіційному сайті та в соціальних мережах Ви завжди можете знайти актуальні новини "
    "та всю необхідну інформацію про діяльність КП \"ОМЕТ\".\n\n"
    "Підписуйтесь, щоб нічого не пропустити! 👇"
),
"company_history": COMPANY_HISTORY,


}